perf/seccion2/response-time/server-a.out

> perf@1.0.0 artillery
> artillery "run" "seccion2/response-time/1rps.yml" "-e" "servera"

Started phase 0 (Plain), duration: 10s @ 13:14:20(-0300) 2021-05-23
Report @ 13:14:30(-0300) 2021-05-23
Elapsed time: 10 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: NaN
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN

Started phase 1 (Plain), duration: 60s @ 13:14:30(-0300) 2021-05-23
Report @ 13:14:40(-0300) 2021-05-23
Elapsed time: 20 seconds
  Scenarios launched:  9
  Scenarios completed: 8
  Requests completed:  8
  Mean response/sec: 1
  Response time (msec):
    min: 1001
    max: 1002
    median: 1001
    p95: 1002
    p99: 1002
  Codes:
    200: 8

Report @ 13:14:50(-0300) 2021-05-23
Elapsed time: 30 seconds
  Scenarios launched:  10
  Scenarios completed: 10
  Requests completed:  10
  Mean response/sec: 1
  Response time (msec):
    min: 1001
    max: 1001
    median: 1001
    p95: 1001
    p99: 1001
  Codes:
    200: 10

Report @ 13:15:00(-0300) 2021-05-23
Elapsed time: 40 seconds
  Scenarios launched:  10
  Scenarios completed: 10
  Requests completed:  10
  Mean response/sec: 1
  Response time (msec):
    min: 1001
    max: 1002
    median: 1001
    p95: 1002
    p99: 1002
  Codes:
    200: 10

Report @ 13:15:10(-0300) 2021-05-23
Elapsed time: 50 seconds
  Scenarios launched:  10
  Scenarios completed: 10
  Requests completed:  10
  Mean response/sec: 1
  Response time (msec):
    min: 1001
    max: 1002
    median: 1001
    p95: 1002
    p99: 1002
  Codes:
    200: 10

Report @ 13:15:20(-0300) 2021-05-23
Elapsed time: 1 minute, 0 seconds
  Scenarios launched:  10
  Scenarios completed: 10
  Requests completed:  10
  Mean response/sec: 1
  Response time (msec):
    min: 1001
    max: 1002
    median: 1001
    p95: 1002
    p99: 1002
  Codes:
    200: 10

Report @ 13:15:30(-0300) 2021-05-23
Elapsed time: 1 minute, 10 seconds
  Scenarios launched:  10
  Scenarios completed: 10
  Requests completed:  10
  Mean response/sec: 1
  Response time (msec):
    min: 1001
    max: 1002
    median: 1001
    p95: 1002
    p99: 1002
  Codes:
    200: 10

Started phase 2 (Plain), duration: 10s @ 13:15:30(-0300) 2021-05-23
Report @ 13:15:40(-0300) 2021-05-23
Elapsed time: 1 minute, 20 seconds
  Scenarios launched:  1
  Scenarios completed: 2
  Requests completed:  2
  Mean response/sec: 0.1
  Response time (msec):
    min: 1001
    max: 1001
    median: 1001
    p95: 1001
    p99: 1001
  Codes:
    200: 2

Report @ 13:15:41(-0300) 2021-05-23
Elapsed time: 1 minute, 20 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: NaN
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN

All virtual users finished
Summary report @ 13:15:41(-0300) 2021-05-23
  Scenarios launched:  60
  Scenarios completed: 60
  Requests completed:  60
  Mean response/sec: 0.86
  Response time (msec):
    min: 1001
    max: 1002
    median: 1001
    p95: 1002
    p99: 1002
  Scenario counts:
    load testing 1 (/): 60 (100%)
  Codes:
    200: 60