perf/seccion2/response-time/server-b.out

> perf@1.0.0 artillery
> artillery "run" "seccion2/response-time/1rps.yml" "-e" "serverb"

Started phase 0 (Plain), duration: 10s @ 13:40:51(-0300) 2021-05-23
Report @ 13:41:01(-0300) 2021-05-23
Elapsed time: 10 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: NaN
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN

Started phase 1 (Plain), duration: 60s @ 13:41:01(-0300) 2021-05-23
Report @ 13:41:11(-0300) 2021-05-23
Elapsed time: 20 seconds
  Scenarios launched:  9
  Scenarios completed: 9
  Requests completed:  9
  Mean response/sec: 1
  Response time (msec):
    min: 651
    max: 658
    median: 652
    p95: 658
    p99: 658
  Codes:
    200: 9

Report @ 13:41:21(-0300) 2021-05-23
Elapsed time: 30 seconds
  Scenarios launched:  10
  Scenarios completed: 10
  Requests completed:  10
  Mean response/sec: 1
  Response time (msec):
    min: 651
    max: 652
    median: 651.5
    p95: 652
    p99: 652
  Codes:
    200: 10

Report @ 13:41:31(-0300) 2021-05-23
Elapsed time: 40 seconds
  Scenarios launched:  10
  Scenarios completed: 10
  Requests completed:  10
  Mean response/sec: 1
  Response time (msec):
    min: 651
    max: 652
    median: 651
    p95: 652
    p99: 652
  Codes:
    200: 10

Report @ 13:41:41(-0300) 2021-05-23
Elapsed time: 50 seconds
  Scenarios launched:  10
  Scenarios completed: 10
  Requests completed:  10
  Mean response/sec: 1
  Response time (msec):
    min: 651
    max: 652
    median: 651
    p95: 652
    p99: 652
  Codes:
    200: 10

Report @ 13:41:51(-0300) 2021-05-23
Elapsed time: 1 minute, 0 seconds
  Scenarios launched:  10
  Scenarios completed: 10
  Requests completed:  10
  Mean response/sec: 1
  Response time (msec):
    min: 651
    max: 651
    median: 651
    p95: 651
    p99: 651
  Codes:
    200: 10

Report @ 13:42:01(-0300) 2021-05-23
Elapsed time: 1 minute, 10 seconds
  Scenarios launched:  10
  Scenarios completed: 10
  Requests completed:  10
  Mean response/sec: 1
  Response time (msec):
    min: 651
    max: 652
    median: 651
    p95: 652
    p99: 652
  Codes:
    200: 10

Started phase 2 (Plain), duration: 10s @ 13:42:01(-0300) 2021-05-23
Report @ 13:42:11(-0300) 2021-05-23
Elapsed time: 1 minute, 20 seconds
  Scenarios launched:  1
  Scenarios completed: 1
  Requests completed:  1
  Mean response/sec: 0.1
  Response time (msec):
    min: 652
    max: 652
    median: 652
    p95: 652
    p99: 652
  Codes:
    200: 1

Report @ 13:42:11(-0300) 2021-05-23
Elapsed time: 1 minute, 20 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: NaN
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN

All virtual users finished
Summary report @ 13:42:11(-0300) 2021-05-23
  Scenarios launched:  60
  Scenarios completed: 60
  Requests completed:  60
  Mean response/sec: 0.86
  Response time (msec):
    min: 651
    max: 658
    median: 651
    p95: 652
    p99: 657.4
  Scenario counts:
    load testing 1 (/): 60 (100%)
  Codes:
    200: 60